Revit 2027 API
ViewPlan.AreaScheme Property
The area scheme.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AreaScheme AreaScheme { get; }
Public ReadOnly Property AreaScheme As AreaScheme
	Get
public:
property AreaScheme^ AreaScheme {
	AreaScheme^ get ();
}
member AreaScheme : AreaScheme with get
Property Value
AreaScheme
Returns null if this plan view is not an area plan.
See Also
Reference
ViewPlan Class
Autodesk.Revit.DB Namespace